soap/wsdl.xml

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:plink="http://schemas.xmlsoap.org/ws/2003/05/partner-link/" xmlns:wsdlsoap11="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdlsoap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap11enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap11env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap12env="http://www.w3.org/2003/05/soap-envelope" xmlns:soap12enc="http://www.w3.org/2003/05/soap-encoding" xmlns:wsa="http://schemas.xmlsoap.org/ws/2003/03/addressing" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:tns="iot.soap" xmlns:s0="iot.soap.model" targetNamespace="iot.soap" name="Application"><wsdl:types><xs:schema targetNamespace="iot.soap" elementFormDefault="qualified"><xs:import namespace="iot.soap.model"/><xs:complexType name="actualizar_dispositivo"><xs:sequence><xs:element name="id_dispositivo" type="xs:integer" minOccurs="0" nillable="true"/><xs:element name="marca" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="numero_serie" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="crear_dispositivo"><xs:sequence><xs:element name="id_usuario" type="xs:integer" minOccurs="0" nillable="true"/><xs:element name="marca" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="numero_serie" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="eliminar_dispositivo"><xs:sequence><xs:element name="id_dispositivo" type="xs:integer" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="eliminar_dispositivoResponse"><xs:sequence><xs:element name="eliminar_dispositivoResult" type="xs:boolean" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="listar_dispositivos_por_usuario"><xs:sequence><xs:element name="id_usuario" type="xs:integer" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="obtener_dispositivo"><xs:sequence><xs:element name="id_dispositivo" type="xs:integer" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="listar_dispositivos_por_usuarioResponse"><xs:sequence><xs:element name="listar_dispositivos_por_usuarioResult" type="s0:DispositivoArray" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="actualizar_dispositivoResponse"><xs:sequence><xs:element name="actualizar_dispositivoResult" type="s0:Dispositivo" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="crear_dispositivoResponse"><xs:sequence><xs:element name="crear_dispositivoResult" type="s0:Dispositivo" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="obtener_dispositivoResponse"><xs:sequence><xs:element name="obtener_dispositivoResult" type="s0:Dispositivo" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:element name="actualizar_dispositivo" type="tns:actualizar_dispositivo"/><xs:element name="crear_dispositivo" type="tns:crear_dispositivo"/><xs:element name="eliminar_dispositivo" type="tns:eliminar_dispositivo"/><xs:element name="eliminar_dispositivoResponse" type="tns:eliminar_dispositivoResponse"/><xs:element name="listar_dispositivos_por_usuario" type="tns:listar_dispositivos_por_usuario"/><xs:element name="obtener_dispositivo" type="tns:obtener_dispositivo"/><xs:element name="listar_dispositivos_por_usuarioResponse" type="tns:listar_dispositivos_por_usuarioResponse"/><xs:element name="actualizar_dispositivoResponse" type="tns:actualizar_dispositivoResponse"/><xs:element name="crear_dispositivoResponse" type="tns:crear_dispositivoResponse"/><xs:element name="obtener_dispositivoResponse" type="tns:obtener_dispositivoResponse"/></xs:schema><xs:schema targetNamespace="iot.soap.model" elementFormDefault="qualified"><xs:simpleType name="Dispositivo_marcaType"><xs:restriction base="xs:string"><xs:maxLength value="100"/></xs:restriction></xs:simpleType><xs:simpleType name="Dispositivo_numero_serieType"><xs:restriction base="xs:string"><xs:maxLength value="150"/></xs:restriction></xs:simpleType><xs:complexType name="Dispositivo"><xs:sequence><xs:element name="id_dispositivo" type="xs:integer" minOccurs="0" nillable="true"/><xs:element name="id_usuario" type="xs:integer" minOccurs="0" nillable="true"/><xs:element name="marca" type="s0:Dispositivo_marcaType" minOccurs="0" nillable="true"/><xs:element name="numero_serie" type="s0:Dispositivo_numero_serieType" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="DispositivoArray"><xs:sequence><xs:element name="Dispositivo" type="s0:Dispositivo" minOccurs="0" maxOccurs="unbounded" nillable="true"/></xs:sequence></xs:complexType><xs:element name="Dispositivo" type="s0:Dispositivo"/><xs:element name="DispositivoArray" type="s0:DispositivoArray"/></xs:schema></wsdl:types><wsdl:message name="crear_dispositivo"><wsdl:part name="crear_dispositivo" element="tns:crear_dispositivo"/></wsdl:message><wsdl:message name="crear_dispositivoResponse"><wsdl:part name="crear_dispositivoResponse" element="tns:crear_dispositivoResponse"/></wsdl:message><wsdl:message name="obtener_dispositivo"><wsdl:part name="obtener_dispositivo" element="tns:obtener_dispositivo"/></wsdl:message><wsdl:message name="obtener_dispositivoResponse"><wsdl:part name="obtener_dispositivoResponse" element="tns:obtener_dispositivoResponse"/></wsdl:message><wsdl:message name="listar_dispositivos_por_usuario"><wsdl:part name="listar_dispositivos_por_usuario" element="tns:listar_dispositivos_por_usuario"/></wsdl:message><wsdl:message name="listar_dispositivos_por_usuarioResponse"><wsdl:part name="listar_dispositivos_por_usuarioResponse" element="tns:listar_dispositivos_por_usuarioResponse"/></wsdl:message><wsdl:message name="actualizar_dispositivo"><wsdl:part name="actualizar_dispositivo" element="tns:actualizar_dispositivo"/></wsdl:message><wsdl:message name="actualizar_dispositivoResponse"><wsdl:part name="actualizar_dispositivoResponse" element="tns:actualizar_dispositivoResponse"/></wsdl:message><wsdl:message name="eliminar_dispositivo"><wsdl:part name="eliminar_dispositivo" element="tns:eliminar_dispositivo"/></wsdl:message><wsdl:message name="eliminar_dispositivoResponse"><wsdl:part name="eliminar_dispositivoResponse" element="tns:eliminar_dispositivoResponse"/></wsdl:message><wsdl:service name="DispositivoService"><wsdl:port name="Application" binding="tns:Application"><wsdlsoap11:address location="http://localhost:8000/"/></wsdl:port></wsdl:service><wsdl:portType name="Application"><wsdl:operation name="crear_dispositivo" parameterOrder="crear_dispositivo"><wsdl:input name="crear_dispositivo" message="tns:crear_dispositivo"/><wsdl:output name="crear_dispositivoResponse" message="tns:crear_dispositivoResponse"/></wsdl:operation><wsdl:operation name="obtener_dispositivo" parameterOrder="obtener_dispositivo"><wsdl:input name="obtener_dispositivo" message="tns:obtener_dispositivo"/><wsdl:output name="obtener_dispositivoResponse" message="tns:obtener_dispositivoResponse"/></wsdl:operation><wsdl:operation name="listar_dispositivos_por_usuario" parameterOrder="listar_dispositivos_por_usuario"><wsdl:input name="listar_dispositivos_por_usuario" message="tns:listar_dispositivos_por_usuario"/><wsdl:output name="listar_dispositivos_por_usuarioResponse" message="tns:listar_dispositivos_por_usuarioResponse"/></wsdl:operation><wsdl:operation name="actualizar_dispositivo" parameterOrder="actualizar_dispositivo"><wsdl:input name="actualizar_dispositivo" message="tns:actualizar_dispositivo"/><wsdl:output name="actualizar_dispositivoResponse" message="tns:actualizar_dispositivoResponse"/></wsdl:operation><wsdl:operation name="eliminar_dispositivo" parameterOrder="eliminar_dispositivo"><wsdl:input name="eliminar_dispositivo" message="tns:eliminar_dispositivo"/><wsdl:output name="eliminar_dispositivoResponse" message="tns:eliminar_dispositivoResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="Application" type="tns:Application"><wsdlsoap11:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="crear_dispositivo"><wsdlsoap11:operation soapAction="crear_dispositivo" style="document"/><wsdl:input name="crear_dispositivo"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="crear_dispositivoResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="obtener_dispositivo"><wsdlsoap11:operation soapAction="obtener_dispositivo" style="document"/><wsdl:input name="obtener_dispositivo"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="obtener_dispositivoResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="listar_dispositivos_por_usuario"><wsdlsoap11:operation soapAction="listar_dispositivos_por_usuario" style="document"/><wsdl:input name="listar_dispositivos_por_usuario"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="listar_dispositivos_por_usuarioResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="actualizar_dispositivo"><wsdlsoap11:operation soapAction="actualizar_dispositivo" style="document"/><wsdl:input name="actualizar_dispositivo"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="actualizar_dispositivoResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="eliminar_dispositivo"><wsdlsoap11:operation soapAction="eliminar_dispositivo" style="document"/><wsdl:input name="eliminar_dispositivo"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="eliminar_dispositivoResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding></wsdl:definitions>
