README.md


# Plataforma IoT con Servicios SOAP y REST

# Luis Gabriel Venegas Saucedo 
# Joshua Neftali Marin Leynez



##  API REST (Spring Boot) - Endpoints

La API utiliza JSON para el intercambio de datos.

### 1\. Gesti贸n de Usuarios (`/api/usuarios`)

Control total sobre los perfiles de los atletas.

| M茅todo | Endpoint | Descripci贸n |
| :--- | :--- | :--- |
| `GET` | `/` | Lista todos los usuarios registrados. |
| `GET` | `/{id}` | Obtiene el detalle de un usuario por su ID. |
| `POST` | `/` | Registra un nuevo usuario. |
| `PUT` | `/{id}` | Actualiza la informaci贸n de un usuario existente. |
| `DELETE` | `/{id}` | Elimina un usuario del sistema. |

**Ejemplo de Payload (POST/PUT):**

```json
{
    "nombre": "Luis",
    "apellido": "Venegas",
    "correoElectronico": "luis.venegas@email.com",
    "fechaDeNacimiento": "2000-01-01",
    "genero": "Masculino",
    "peso": 75.5,
    "altura": 1.78
}
```

### 2\. Sesiones de Entrenamiento (`/api/sesion_entrenamiento`)

Registro de actividades deportivas (Correr, Nadar, Ciclismo, etc.).

| M茅todo | Endpoint | Descripci贸n |
| :--- | :--- | :--- |
| `GET` | `/` | Historial completo de sesiones. |
| `GET` | `/{id}` | Detalle de una sesi贸n espec铆fica. |
| `POST` | `/` | Crea una nueva sesi贸n de entrenamiento. |
| `PUT` | `/{id}` | Modifica una sesi贸n existente. |
| `DELETE` | `/{id}` | Elimina una sesi贸n. |

**Ejemplo de Payload (POST):**

```json
{
    "usuario": {
        "id_usuario": 1
    },
    "tipoActividad": "Correr",
    "fechaHoraInicio": "2024-05-20T08:00:00",
    "fechaHoraFin": "2024-05-20T09:00:00",
    "duracionSegundos": 3600,
    "distanciaMetros": 10000.0,
    "caloriasQuemadas": 750,
    "latitudInicio": 19.432608,
    "longitudInicio": -99.133209,
    "ritmoPromedio": 5
}
```

*Tipos de Actividad Soportados:* `Correr`, `Caminar`, `Nadar`, `Ciclismo`, `Levantamiento_de_pesas`, `Yoga`, `Otro`.

### 3\. Frecuencia Card铆aca (`/api/frecuencia_cardiaca`)

Registro detallado de m茅tricas biom茅tricas vinculadas a una sesi贸n.

| M茅todo | Endpoint | Descripci贸n |
| :--- | :--- | :--- |
| `GET` | `/` | Lista todas las mediciones. |
| `GET` | `/{id}` | Obtiene una medici贸n espec铆fica. |
| `POST` | `/` | Registra una medici贸n puntual. |
| `PUT` | `/{id}` | Actualiza una medici贸n. |
| `DELETE` | `/{id}` | Elimina una medici贸n. |

**Ejemplo de Payload (POST):**

```json
{
    "sesionEntrenamiento": {
        "id_sesion": 1
    },
    "fechaHoraRegistro": "2024-05-20T08:15:00",
    "frecuenciaCardiaca": 145,
    "oxigenacion": 98,
    "presion": "120/80"
}
```

-----

##  API SOAP (Python) - Operaciones

Todas las peticiones deben ser `POST` con `Content-Type: text/xml`.
Namespace: `xmlns:iot="iot.soap"`

### 1\. Inventario de Dispositivos (Usuarios)

Gesti贸n de la asignaci贸n de dispositivos a usuarios (Tabla `Dispositivos`).

  * **`crear_dispositivo`**: Asigna un dispositivo a un usuario.
  * **`obtener_dispositivo`**: Busca un dispositivo por su ID 煤nico.
  * **`listar_dispositivos_por_usuario`**: Muestra todos los dispositivos de un usuario.
  * **`listar_dispositivos`**: Inventario global de dispositivos asignados.
  * **`actualizar_dispositivo`**: Modifica marca o n煤mero de serie.
  * **`eliminar_dispositivo`**: Desvincula/Borra un dispositivo.

**Ejemplo XML (Crear Dispositivo):**

```xml
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iot="iot.soap">
   <soapenv:Body>
      <iot:crear_dispositivo>
         <iot:id_usuario>1</iot:id_usuario>
         <iot:marca>Garmin</iot:marca>
         <iot:numero_serie>SN-123456789</iot:numero_serie>
      </iot:crear_dispositivo>
   </soapenv:Body>
</soapenv:Envelope>
```

### 2\. Cat谩logo IoT

Gesti贸n de modelos de dispositivos soportados (Tabla `dispositivos_iot`).

  * **`crear_dispositivo_iot`**: Registra un nuevo modelo en el cat谩logo.
  * **`listar_dispositivos_iot`**: Lista todos los modelos disponibles.

**Ejemplo XML (Crear Modelo):**

```xml
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iot="iot.soap">
   <soapenv:Body>
      <iot:crear_dispositivo_iot>
         <iot:modelo>Apple Watch Series 9</iot:modelo>
      </iot:crear_dispositivo_iot>
   </soapenv:Body>
</soapenv:Envelope>
```

### 3\. Usuarios (Solo Lectura)

Espejo de la tabla de usuarios para sistemas SOAP.

  * **`listar_usuarios`**: Devuelve la lista de usuarios (creados en REST) para consulta desde SOAP.

### 4\. Gesti贸n de Sesiones (SOAP)

Funcionalidad espejo para registrar entrenamientos desde clientes SOAP.

  * **`crear_sesion`**: Permite registrar una sesi贸n de entrenamiento.
  * **`listar_sesiones_por_usuario`**: Consulta sesiones en un rango de fechas.

**Ejemplo XML (Crear Sesi贸n):**

```xml
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iot="iot.soap">
   <soapenv:Body>
      <iot:crear_sesion>
         <iot:id_usuario>1</iot:id_usuario>
         <iot:tipo_actividad>Ciclismo</iot:tipo_actividad>
         <iot:fecha_hora_inicio>2024-06-01T10:00:00</iot:fecha_hora_inicio>
         <iot:fecha_hora_fin>2024-06-01T12:00:00</iot:fecha_hora_fin>
         <iot:duracion_segundos>7200</iot:duracion_segundos>
         <iot:distancia_metros>45000.5</iot:distancia_metros>
         <iot:calorias_quemadas>1200</iot:calorias_quemadas>
         <iot:latitud_inicio>19.43</iot:latitud_inicio>
         <iot:longitud_inicio>-99.13</iot:longitud_inicio>
         <iot:ritmo_promedio>25</iot:ritmo_promedio>
      </iot:crear_sesion>
   </soapenv:Body>
</soapenv:Envelope>
```

### 5\. Actividad F铆sica y Sensores (Datos Crudos)

M贸dulo para la ingesta de datos raw desde los dispositivos.

  * **`crear_actividad`**: Registra un bloque de actividad f铆sica general.
  * **`registrar_dato_sensor`**: Inserta un dato puntual de sensores (FC, Oxigenaci贸n, Presi贸n) vinculado a una actividad.

**Ejemplo XML (Registrar Dato Sensor):**

```xml
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iot="iot.soap">
   <soapenv:Body>
      <iot:registrar_dato_sensor>
         <iot:id_actividad>1</iot:id_actividad>
         <iot:id_usuario>1</iot:id_usuario>
         <iot:fecha_hora_registro>2024-06-01T10:05:00</iot:fecha_hora_registro>
         <iot:frecuencia_cardiaca>135</iot:frecuencia_cardiaca>
         <iot:oxigenacion>97</iot:oxigenacion>
         <iot:presion>120/80</iot:presion>
      </iot:registrar_dato_sensor>
   </soapenv:Body>
</soapenv:Envelope>
```

### 6\. Reportes

Generaci贸n de res煤menes y anal铆ticas.

  * **`resumen_diario_usuario`**: Calcula el total de kil贸metros, calor铆as y promedios biom茅tricos de un usuario en una fecha espec铆fica.

**Ejemplo XML:**

```xml
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iot="iot.soap">
   <soapenv:Body>
      <iot:resumen_diario_usuario>
         <iot:id_usuario>1</iot:id_usuario>
         <iot:fecha>2024-06-01</iot:fecha>
      </iot:resumen_diario_usuario>
   </soapenv:Body>
</soapenv:Envelope>
```
